Tekla.Structures.ModelInternal.Dstv.DstvHeader
The dstv header information.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.Filename
The filename.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.ProjectNumber
The project number.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.PhaseNumber
The phase number.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.PartMark
The part mark.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.DrawingMark
The drawing mark.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.Material
The material.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.Quantity
The quantity.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.Profile
The profile.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.ProfileType
The Profile type.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.NetLength
The net length.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.GrossLength
The gross length.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.ProfileHeight
The profile height.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.FlangeHeight
The flange height.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.FlangeThickness
The flange thickness.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.WebThickness
The web thickness.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.Radius
The radius.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.MeterWeight
The weight by meter.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.FinishArea
The painting surface by meter.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.WebAngleFront
The skew angle for web's front.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.WebAngleBack
The skew angle for web's back.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.FlangeAngleFront
The skew angle for flange's front.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.FlangeAngleBack
The skew angle for flange's back.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.InfoText1
The information text 1.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.InfoText2
The information text 2.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.InfoText3
The information text 3.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.InfoText4
The information text 4.

Tekla.Structures.ModelInternal.Dstv.DstvHeader.Comments
The list of comments.